In [5]:
import pandas as pd
import numpy as np

In [6]:
## Create given Data Frame
df = pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4]})
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [16]:
## Chage the Series to List
df.X.tolist()

[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]

In [12]:
## Create List of values to be added in Y Column
l = df.X.tolist()
i = 0
r = []

for element in l:
    if element != 0:
        i += 1
    else:
        i = 0
    r.append(i)
    
r

[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

In [17]:
## Ansewer 1
df["Y"] = r
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [7]:
## Answer 2
dti = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dti)), index=dti)
dti
s

2015-01-01    0.777671
2015-01-02    0.250873
2015-01-05    0.025275
2015-01-06    0.318171
2015-01-07    0.097616
2015-01-08    0.914372
2015-01-09    0.554641
2015-01-12    0.263093
2015-01-13    0.328004
2015-01-14    0.244077
2015-01-15    0.844630
2015-01-16    0.658330
2015-01-19    0.548907
2015-01-20    0.933664
2015-01-21    0.077984
2015-01-22    0.871646
2015-01-23    0.745483
2015-01-26    0.724988
2015-01-27    0.832028
2015-01-28    0.720526
2015-01-29    0.988385
2015-01-30    0.752445
2015-02-02    0.675700
2015-02-03    0.198305
2015-02-04    0.845848
2015-02-05    0.008925
2015-02-06    0.137935
2015-02-09    0.104936
2015-02-10    0.188198
2015-02-11    0.054085
                ...
2015-11-20    0.683495
2015-11-23    0.048329
2015-11-24    0.680898
2015-11-25    0.116349
2015-11-26    0.506355
2015-11-27    0.687727
2015-11-30    0.609028
2015-12-01    0.976979
2015-12-02    0.157576
2015-12-03    0.605821
2015-12-04    0.467867
2015-12-07    0.335921
2015-12-08    0.687691
2015-12-09    0.872111
2015-12-10    0.870164
2015-12-11    0.727192
2015-12-14    0.247969
2015-12-15    0.648000
2015-12-16    0.553803
2015-12-17    0.124256
2015-12-18    0.670057
2015-12-21    0.044485
2015-12-22    0.121032
2015-12-23    0.399763
2015-12-24    0.834310
2015-12-25    0.575370
2015-12-28    0.977824
2015-12-29    0.265471
2015-12-30    0.969555
2015-12-31    0.161266
Freq: B, Length: 261, dtype: float64

In [8]:
# Answer 3
s[s.index.weekday == 2].sum()

26.84559453423191

In [9]:
# Answer  4
# Average For each calendar month
s.resample('M').mean()

2015-01-31    0.566946
2015-02-28    0.397200
2015-03-31    0.567573
2015-04-30    0.511505
2015-05-31    0.580706
2015-06-30    0.533353
2015-07-31    0.494445
2015-08-31    0.466612
2015-09-30    0.558700
2015-10-31    0.488572
2015-11-30    0.508291
2015-12-31    0.534543
Freq: M, dtype: float64

In [10]:
# Answer 5
#For each group of four consecutive calendar months in s, find the date on which the highest value occurred.
s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-29
2015-05-31   2015-04-10
2015-09-30   2015-09-23
2016-01-31   2015-10-30
dtype: datetime64[ns]